/**
  ****************************(C) COPYRIGHT 2024 Polarbear****************************
  * @file       mechanical_arm_engineer.c/h
  * @brief      机械臂功能。
  * @note
  * @history
  *  Version    Date            Author          Modification
  *  V1.0.1     Aug-20-2024     Penguin         1. done
  *
  @verbatim
  ==============================================================================

  ==============================================================================
  @endverbatim
  ****************************(C) COPYRIGHT 2024 Polarbear****************************
  */

#include "mechanical_arm_engineer.h"

#if (MECHANICAL_ARM_TYPE == MECHANICAL_ARM_ENGINEER_ARM)
#include <stdbool.h>

#include "CAN_communication.h"
#include "bsp_delay.h"
#include "custom_controller_connect.h"
#include "math.h"
#include "pid.h"
#include "signal_generator.h"
#include "usb_debug.h"

/*------------------------------ Variable Definition ------------------------------*/
MechanicalArm_s MECHANICAL_ARM;

/*------------------------------ Function Definition ------------------------------*/

/******************************************************************/
/* Publish                                                        */
/******************************************************************/

void MechanicalArmPublish(void) {}

/******************************************************************/
/* Init                                                           */
/******************************************************************/

void MechanicalArmInit(void) {}

/******************************************************************/
/* HandleException                                                */
/******************************************************************/

void MechanicalArmHandleException(void) {}

/******************************************************************/
/* SetMode                                                        */
/******************************************************************/

void MechanicalArmSetMode(void) {}

/******************************************************************/
/* Observer                                                       */
/******************************************************************/

void MechanicalArmObserver(void) {}

/******************************************************************/
/* Reference                                                      */
/******************************************************************/

void MechanicalArmReference(void) {}

/******************************************************************/
/* Console                                                        */
/******************************************************************/

void MechanicalArmConsole(void) {}

/******************************************************************/
/* SendCmd                                                        */
/******************************************************************/

void MechanicalArmSendCmd(void) {}

#endif
/*------------------------------ End of File ------------------------------*/
